#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОтразитьЗначенияШкалыПоказателей(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗначенияШкалыПоказателей;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗначенияШкалыПоказателей = Движения.УБ_ЗначенияШкалыПоказателей;
	ДвиженияЗначенияШкалыПоказателей.Записывать = Истина;
	ДвиженияЗначенияШкалыПоказателей.Загрузить(Таблица);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли