
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	перем Свойство;
    перем Период;
	
	Если Параметры.Свойство("ОтключитьИерархию") Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;   
	

	Параметры.Свойство("РежимВыбора", Свойство);   //истина - когда подбор
	Если  Свойство Тогда                        
		Элементы.ОтобранныеПоказатели.Видимость = Истина;
		Элементы.КнопкаЗакрыть.Видимость = Истина;
		АдресПоказателейВХранилище = Параметры.АдресВХранилище;
		ОтобранныеПоказатели.Загрузить(ПолучитьИзВременногоХранилища(АдресПоказателейВХранилище));
	Иначе
		Элементы.ОтобранныеПоказатели.Видимость = Ложь;
	КонецЕсли;                                             
	
	Если  Параметры.Свойство("Период", Свойство) Тогда                        
		Список.Параметры.УстановитьЗначениеПараметра("Период", Свойство);	
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());	
	КонецЕсли;   
	
	УБ_ОбщегоНазначения.СкорректироватьТекстЗапросаПодТекущуюКонфигурацию(Список.ТекстЗапроса);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ОтобранныеПоказатели.Количество() Тогда
		УБ_ТабличныеЧастиКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, "ОтобранныеПоказатели", Параметры, "КлючСвязи");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Если Параметры.РежимВыбора Тогда   
		СтандартнаяОбработка = Ложь;
		ДобавитьПоказатель(Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоказатель(Показатель)
	
	НайденныеСтроки =  ОтобранныеПоказатели.НайтиСтроки(Новый Структура("показатель", Показатель));
	Если НайденныеСтроки.Количество() Тогда
		//ничего не предпринимаем							 	
	Иначе
		Элемент = ОтобранныеПоказатели.Вставить(0);
		Элемент.показатель = Показатель;
		Элемент.КлючСвязи = Параметры.КлючСвязи;
		Элементы.ОтобранныеПоказатели.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();	
	КонецЕсли;

КонецПроцедуры   

&НаКлиенте
Процедура ОК(Команда)
	ЗаписатьПодборВХранилище();
   	ВладелецФормы.ОбработатьПодбор();
	Закрыть();
КонецПроцедуры     

&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	ТабОтобранныеПоказатели	= ОтобранныеПоказатели.Выгрузить();
	ТабОтобранныеПоказатели.ЗаполнитьЗначения(Параметры.КлючСвязи, "КлючСвязи");
	ПоместитьВоВременноеХранилище(ТабОтобранныеПоказатели, АдресПоказателейВХранилище);

КонецПроцедуры
 


