#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОтразитьДанныеНачисленийРасчетаЭффективностиСотрудников(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДанныеНачисленийРасчетаЭффективностиСотрудников;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДанныеНачисленийРасчетаЭффективностиСотрудников = Движения.УБ_ДанныеНачисленийРасчетаЭффективностиСотрудников;
	ДвиженияДанныеНачисленийРасчетаЭффективностиСотрудников.Записывать = Истина;
	ДвиженияДанныеНачисленийРасчетаЭффективностиСотрудников.Загрузить(Таблица);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли