#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОтразитьСоставСтандартовМоделейПланирования(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСоставСтандартовМоделейПланирования;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСоставСтандартовМоделейПланирования = Движения.УБ_СоставСтандартовМоделейПланирования;
	ДвиженияСоставСтандартовМоделейПланирования.Записывать = Истина;
	ДвиженияСоставСтандартовМоделейПланирования.Загрузить(Таблица);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли