Функция ПолучитьЦветаСтиля(ИмяФормы = "ПолучитьВсе") Экспорт
	ПолучитьВсеЦвета = (ИмяФормы = "ПолучитьВсе");
	
	Результат = Новый Структура();
	
	Если ПолучитьВсеЦвета ИЛИ ИмяФормы = "РЭ" Тогда
		Результат.Вставить("Заполнен", ЦветаСтиля.ЦветАкцента);
		Результат.Вставить("ПланУтвержден", ЦветаСтиля.ЦветВажного);
		Результат.Вставить("НеЗаполнен",ЦветаСтиля.ПросроченныеДанныеЦвет);
	КонецЕсли;
	
	Если ПолучитьВсеЦвета ИЛИ ИмяФормы = "УМММ" Тогда
		Результат.Вставить("Действует", ЦветаСтиля.ЦветАкцента);
		Результат.Вставить("ДействуетТекст", ЦветаСтиля.ЦветФонаФормы);
		
		Результат.Вставить("Планируется", ЦветаСтиля.ЦветВажного);
		Результат.Вставить("ПланируетсяТекст", ЦветаСтиля.ЦветТекстаКнопки);
		
		Результат.Вставить("Неактуальный", ЦветаСтиля.ЦветРамкиКнопки);
		Результат.Вставить("НеактуальныйТекст", ЦветаСтиля.ЦветФонаФормы);
		
		Результат.Вставить("Закрыт",ЦветаСтиля.ПросроченныеДанныеЦвет);
		Результат.Вставить("ЗакрытТекст", ЦветаСтиля.ЦветФонаФормы);
	КонецЕсли;
	
	Результат.Вставить("Фон", ЦветаСтиля.ЦветФонаФормы);
	Результат.Вставить("Текст", ЦветаСтиля.ЦветТекстаКнопки);
	Результат.Вставить("НеВыбрано", ЦветаСтиля.ЦветФонаКнопки);
	
	Возврат Результат;
КонецФункции
