#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
//!!! показателей, а у нас цели	РегистрыСведений.УБ_ЗависимостиПоказателейЭффективности.ЗаполнитьЗависимостиПоказателей(ЗависимыеПоказатели, Ссылка);

КонецПроцедуры
	
Процедура ПриКопировании(ОбъектКопирования)
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#КонецЕсли