
Функция ЗначениеРеквизитаПоУмолчанию(ИмяРеквизита = "") Экспорт
	
	ЗначениеПоУмолчанию = Неопределено;
	
	Если УБ_ОбщегоНазначенияПовтИсп.ИспользоватьСправочникиКАУП() Тогда
		
		Если ИмяРеквизита = "Должность" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.Должности.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "Подразделение" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "ПоказательРасчетаЗарплаты" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.ПоказателиРасчетаЗарплаты.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "Сотрудник" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "ШтатноеРасписание" Или ИмяРеквизита = "ДолжностьПоШтатномуРасписанию" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.ШтатноеРасписание.ПустаяСсылка");
		КонецЕсли;
		
	Иначе
		
		Если ИмяРеквизита = "Должность" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.УБ_Должности.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "Подразделение" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.УБ_Подразделения.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "ПоказательРасчетаЗарплаты" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.УБ_ПоказателиРасчетаЗарплаты.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "Сотрудник" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.УБ_Сотрудники.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "ШтатноеРасписание" Или ИмяРеквизита = "ДолжностьПоШтатномуРасписанию" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.УБ_ШтатноеРасписание.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;      
	
	Если ИмяРеквизита = "Компания" Тогда
		ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.УБ_Компании.Компания");
	КонецЕсли;
	
	Если УБ_ОбщегоНазначенияПовтИсп.ЭтоРозница() Тогда
		ЗначениеПоУмолчанию = Неопределено;
	Иначе
		Если ИмяРеквизита = "Проект" Тогда		//проекты предполагаются во всех конфигурациях
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
		КонецЕсли; 		
	КонецЕсли;
	
	Если ИмяРеквизита = "Организация" Тогда
		ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	КонецЕсли;
	
	Возврат  ЗначениеПоУмолчанию;
	
КонецФункции

