#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьЗависимостиПоказателей(ЗависимыеПоказатели, Ссылка) Экспорт
	
	Счетчик = ПолучитьКоличествоЗаписейРегистра() + 1;
	
	НаборЗаписей = РегистрыСведений.УБ_ЗависимостиПоказателейЭффективности.СоздатьНаборЗаписей();
		
	Для Каждого СтрокаТЧ Из ЗависимыеПоказатели Цикл
		НаборЗаписей.Отбор.ВлияющийПоказатель.Установить(Ссылка);
		Запись = НаборЗаписей.Добавить();
		Запись.НомерПоказателя = Счетчик;
		Запись.Период = ТекущаяДата(); 
		Запись.ВлияющийПоказатель = Ссылка;
		Запись.ЗависимыйПоказатель = СтрокаТЧ.ЗависимыйПоказатель;
		Запись.ДействуетС = СтрокаТЧ.ДействуетС;
		Запись.ПрекратилДействие = СтрокаТЧ.ПрекратилДействиеЧекбокс;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры

Функция ПолучитьКоличествоЗаписейРегистра()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	УБ_ЗависимостиПоказателейЭффективности.НомерПоказателя КАК НомерПоказателя
		|ИЗ
		|	РегистрСведений.УБ_ЗависимостиПоказателейЭффективности КАК УБ_ЗависимостиПоказателейЭффективности
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПоказателя УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.НомерПоказателя;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#КонецЕсли