
#Область ПрограммныйИнтерфейс
// Возвращает список форм, в которых используется ограничение по выбору подразделения
// Возвращаемое значение:
// Массив
Функция ФормаВходитСписокФормКадровыхДокументов(ИмяФормы) Экспорт
	
	МассивФормПроверямыхДокументов = Новый Массив;
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_Делегирование.Форма.ФормаДокумента");
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_НазначениеНаДолжность.Форма.ФормаДокумента");
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_НазначениеРуководителя.Форма.ФормаДокумента");
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_ПланированиеЦелейИПоказателей.Форма.ФормаДокумента");
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_ПереводНаДолжность.Форма.ФормаДокумента");
	
	Возврат Не МассивФормПроверямыхДокументов.Найти(ИмяФормы) = Неопределено;
			
КонецФункции

// Возвращает список форм, в которых используется ограничение по выбору подразделения
// Возвращаемое значение:
// Массив
Функция ФормаВходитСписокФормКадровыхДокументовУБСОтбором(ИмяФормы) Экспорт
	
	МассивФормПроверямыхДокументов = Новый Массив;
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_Делегирование.Форма.ФормаСписка");
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_НазначениеНаДолжность.Форма.ФормаСписка");
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_НазначениеРуководителя.Форма.ФормаСписка");
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_ОтстранениеОтДолжности.Форма.ФормаСписка");
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_ПереводНаДолжность.Форма.ФормаСписка");
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_ПланированиеЦелейИПоказателей.Форма.ФормаСписка");
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_УстановкаПропорцийМатериальнойМотивации.Форма.ФормаСписка");
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_УстановкаФактаПоказателей.Форма.ФормаСписка");
	МассивФормПроверямыхДокументов.Добавить("Документ.УБ_УстановкаФиксированныхПоказателейОрганизации.Форма.ФормаСписка");
// ШОО не работает, но нужно потом	МассивФормПроверямыхДокументов.Добавить("ЖурналДокументов.УБ_КадровыеДокументы.Форма.ФормаСписка");
	
	Возврат Не МассивФормПроверямыхДокументов.Найти(ИмяФормы) = Неопределено;
			
КонецФункции

#КонецОбласти
