
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) 
	
	Если ВАрхиве Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УБ_ВерсииГрейдовСрезПоследних.Статус КАК Статус,
			|	НЕОПРЕДЕЛЕНО КАК Сотрудник
			|ИЗ
			|	РегистрСведений.УБ_ВерсииГрейдов.СрезПоследних(, Грейд = &Грейд) КАК УБ_ВерсииГрейдовСрезПоследних
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НЕОПРЕДЕЛЕНО,
			|	МоделиПланированияСотрудников.Сотрудник
			|ИЗ
			|	РегистрСведений.УБ_МоделиПланированияСотрудников.СрезПоследних(, Грейд = &Грейд) КАК МоделиПланированияСотрудников";
		
		Запрос.УстановитьПараметр("Грейд", Ссылка);	
		РезультатЗапроса = Запрос.Выполнить();	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Статус = Перечисления.УБ_СтатусыМоделейПланирования.Действует Или ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сотрудник) Тогда
				ТекстСообщения = НСтр("ru = 'Невозможно поместить грейд в архив! Данный грейд является действующим или есть сотрудники с данным грейдом!'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
