
#Область ПрограммныйИнтерфейс

Процедура ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(ВладелецФормыВыбора, Организация = Неопределено,
	Подразделение = Неопределено, ДатаПримененияОтбора = '00010101', МножественныйВыбор = Истина,
	АдресСпискаПодобранныхСотрудников = "", ПараметрыОткрытия = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ДатаПримененияОтбора) Тогда
		
		Если ПараметрыОткрытия = Неопределено Тогда
			ПараметрыОткрытия = Новый Структура;
		КонецЕсли;
		
		Если Не ПараметрыОткрытия.Свойство("Отбор") Тогда
			ПараметрыОткрытия.Вставить("Отбор", Новый Структура);
		КонецЕсли;
		
		ПараметрыОткрытия.Отбор.Вставить("ДатаПримененияОтбора", ДатаПримененияОтбора);
		
	КонецЕсли;
	
	ОткрытьФормуВыбораСотрудников(ВладелецФормыВыбора, Организация, Подразделение, МножественныйВыбор,
		ПараметрыОткрытия, АдресСпискаПодобранныхСотрудников);
	
КонецПроцедуры

Процедура ВыбратьСотрудниковРаботающихВПериодеПоПараметрамОткрытияФормыСписка(ВладелецФормыВыбора, Организация = Неопределено,
	Подразделение = Неопределено, НачалоПериодаПримененияОтбора = '00010101', ОкончаниеПериодаПримененияОтбора = '00010101',
	МножественныйВыбор = Истина, АдресСпискаПодобранныхСотрудников = "", ПараметрыОткрытия = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(НачалоПериодаПримененияОтбора) Тогда
		
		Если ПараметрыОткрытия = Неопределено Тогда
			ПараметрыОткрытия = Новый Структура;
		КонецЕсли;
		
		Если Не ПараметрыОткрытия.Свойство("Отбор") Тогда
			ПараметрыОткрытия.Вставить("Отбор", Новый Структура);
		КонецЕсли;
		
		ПараметрыОткрытия.Отбор.Вставить("НачалоПериодаПримененияОтбора", НачалоДня(НачалоПериодаПримененияОтбора));
		Если ЗначениеЗаполнено(ОкончаниеПериодаПримененияОтбора)
			И ОкончаниеПериодаПримененияОтбора > НачалоПериодаПримененияОтбора Тогда
			
			ПараметрыОткрытия.Отбор.Вставить("ОкончаниеПериодаПримененияОтбора", КонецДня(ОкончаниеПериодаПримененияОтбора));
			
		Иначе
			ПараметрыОткрытия.Отбор.Вставить("ОкончаниеПериодаПримененияОтбора", КонецДня(НачалоПериодаПримененияОтбора));
		КонецЕсли;
		
	КонецЕсли;
	
	ОткрытьФормуВыбораСотрудников(ВладелецФормыВыбора, Организация, Подразделение, МножественныйВыбор,
		ПараметрыОткрытия, АдресСпискаПодобранныхСотрудников);
	
КонецПроцедуры

Функция КадровыеДанныеСотрудников(Знач Сотрудник, ДатаНачала) Экспорт
	Возврат  УБ_КадровыйУчетВызовСервера.КадровыеДанныеСотрудников(Сотрудник, ДатаНачала);
КонецФункции

Функция ДействующиеРуководителиПодразделений(Период, Подразделения) Экспорт
	Возврат УБ_КадровыйУчетВызовСервера.ДействующиеРуководителиПодразделений(Период, Подразделения);
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьФормуВыбораСотрудников(ВладелецФормыВыбора, Организация, Подразделение, МножественныйВыбор,
	ПараметрыФормы, АдресСпискаПодобранныхСотрудников)
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", МножественныйВыбор);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Не МножественныйВыбор);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Если Не ПараметрыФормы.Свойство("Отбор") Тогда
			ПараметрыФормы.Вставить("Отбор", Новый Структура);
		КонецЕсли;
		
		ПараметрыФормы.Отбор.Вставить("ТекущаяОрганизация", Организация);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		
		Если Не ПараметрыФормы.Свойство("Отбор") Тогда
			ПараметрыФормы.Вставить("Отбор", Новый Структура);
		КонецЕсли;
		
		ПараметрыФормы.Отбор.Вставить("ТекущееПодразделение", Подразделение);
		
	КонецЕсли;
	
	Если МножественныйВыбор И Не ПустаяСтрока(АдресСпискаПодобранныхСотрудников) Тогда
		ПараметрыФормы.Вставить("АдресСпискаПодобранныхСотрудников", АдресСпискаПодобранныхСотрудников);
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.УБ_ФормаВыбораСотрудника", ПараметрыФормы, ВладелецФормыВыбора,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти
