#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОтразитьКоэффициентыРаспределенияБезокладнойСистемыПоказателей(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаКоэффициентыРаспределенияБезокладнойСистемыПоказателейВакантныхПозиций;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияКоэффициентыРаспределенияБезокладнойСистемыПоказателей = Движения.УБ_КоэффициентыРаспределенияБезокладнойСистемыПоказателейВакантныхПозиций;
	ДвиженияКоэффициентыРаспределенияБезокладнойСистемыПоказателей.Записывать = Истина;
	ДвиженияКоэффициентыРаспределенияБезокладнойСистемыПоказателей.Загрузить(Таблица);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли