
#Область ПрограммныйИнтерфейс

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.УБ_НазначениеНаДолжность);
	СписокОбъектов.Добавить(Документы.УБ_ОтстранениеОтДолжности);
	СписокОбъектов.Добавить(Документы.УБ_ПереводНаДолжность);
	СписокОбъектов.Добавить(Документы.УБ_РасчетЭффективностиСотрудников);
	СписокОбъектов.Добавить(Документы.УБ_УстановкаЗначенийШкалыПоказателей);
	СписокОбъектов.Добавить(Документы.УБ_УтверждениеГрейда);
	
КонецПроцедуры

#КонецОбласти
