////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//
	//УБ_КадровыйУчет.СкорректироватьТекстЗапросаПодТекущуюКонфигурацию(Список.ТекстЗапроса);
	//Если ОбщегоНазначения.Использо Тогда
	//	
	//КонецЕсли;
	//Список.ОсновнаяТаблица = Метаданные.Справочники.ШтатноеРасписание; 
	
	Параметры.Свойство("ПоказыватьСвободные",  ПоказыватьСвободные);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Закрыта",
																				Ложь,
																				ВидСравненияКомпоновкиДанных.Равно,
																				,
																				Истина,
																				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	// кроме того, есть отбор по наличию модели, Организации и Подразделению передаваемый в параметрах при вызове формы
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)   
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокМодельПланирования", "Видимость", ПоказыватьМодели); 
	
	ПереключитьЦвет(Элементы.ПоказыватьСвободные, ПоказыватьСвободные);
	ПереключитьЦвет(Элементы.ПоказыватьМодели, ПоказыватьМодели); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
 
&НаКлиенте
Процедура ПоказыватьСвободныеПриИзменении(Элемент)
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"МодельПланирования",
																			ПредопределенноеЗначение("Справочник.УБ_МоделиПланированияЭффективности.ПустаяСсылка"),
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ПоказыватьСвободные,
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ПереключитьЦвет(Элементы.ПоказыватьСвободные, ПоказыватьСвободные);

КонецПроцедуры  


&НаКлиенте
Процедура ПоказыватьМоделиПриИзменении(Элемент)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокМодельПланирования", "Видимость", ПоказыватьМодели); 
	ПереключитьЦвет(Элементы.ПоказыватьМодели, ПоказыватьМодели);
	
КонецПроцедуры
           

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.МодельПланирования) Тогда

		ОбщегоНазначенияКлиент.СообщитьПользователю("Выбранное штатное расписание используется в другой модели планирования",,,,);
		Возврат;
	КонецЕсли;
	ПараметрыДляФормы = Новый Структура();
	ПараметрыДляФормы.Вставить("ШтатноеРасписаниеПередаваемое", ВыбраннаяСтрока);
	
	Форма = ОткрытьФорму("Справочник.УБ_МоделиПланированияЭффективности.Форма.ФормаЭлемента", ПараметрыДляФормы, ЭтотОбъект.ВладелецФормы);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПереключитьЦвет(Переключатель, Активно)
	УБ_ПользовательскийИнтерфейсКлиент.СменаЦветаПереключателя(Переключатель, Активно);
КонецПроцедуры

#КонецОбласти

