#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОтразитьФормулыПоказателейЭффективности(ДанныеДокументаУтвержденияГрейда) Экспорт
		
	НаборЗаписей = РегистрыСведений.УБ_ФормулыПоказателейЭффективности.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокументаУтвержденияГрейда);
		
	Для Каждого СтрокаТЧ Из ДанныеДокументаУтвержденияГрейда.ФормулыРасчета Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ПоказательЭффективности) 
			И ЗначениеЗаполнено(СтрокаТЧ.ФормулаРасчета) И ЗначениеЗаполнено(СтрокаТЧ.Ячейка) Тогда
			//Отбор = Новый Структура;
			//Отбор.Вставить("ПоказательЭффективности",СтрокаТЧ.ПоказательЭффективности);
			//ДанныеПоказателя = ДанныеДокументаУтвержденияГрейда.Показатели.НайтиСтроки(Отбор);
			Запись = НаборЗаписей.Добавить();
			Запись.Период = ДанныеДокументаУтвержденияГрейда.Дата; 
			Запись.МодельПланирования = ДанныеДокументаУтвержденияГрейда.МодельПланированияЭффективности;
			Запись.Грейд = ДанныеДокументаУтвержденияГрейда.Грейд;
			Запись.ВерсияГрейда = ДанныеДокументаУтвержденияГрейда.ВерсияГрейда;
			Запись.ПоказательЭффективности = СтрокаТЧ.ПоказательЭффективности;
			Запись.ФормулаРасчета = СтрокаТЧ.ФормулаРасчета;
			Запись.Ячейка = СтрокаТЧ.Ячейка;
		КонецЕсли;	
	КонецЦикла;
	
	Для каждого Строка из ДанныеДокументаУтвержденияГрейда.ТипыПоказателей Цикл
		Если ЗначениеЗаполнено(Строка.ТипПоказателя) 
			И ЗначениеЗаполнено(Строка.ФормулаРасчета) Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Период = ДанныеДокументаУтвержденияГрейда.Дата; 
			Запись.МодельПланирования = ДанныеДокументаУтвержденияГрейда.МодельПланированияЭффективности;
			Запись.Грейд = ДанныеДокументаУтвержденияГрейда.Грейд;
			Запись.ВерсияГрейда = ДанныеДокументаУтвержденияГрейда.ВерсияГрейда;
			Запись.ПоказательЭффективности = Строка.ТипПоказателя;
			Запись.ФормулаРасчета = Строка.ФормулаРасчета;
			Если Строка.ТипПоказателя.Матричный Тогда
				Запись.Ячейка = "ПроцентПремии";
			Иначе
				Запись.Ячейка = "Сумма";
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли