Процедура ПриНачалеРаботыСистемы(ИмяПользователя = Неопределено) Экспорт
	
	// ШОО устарело в связи с удалением дашборда, но оставлено для образца
	
	//НастройкиНачальнойСтраницы = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы");
	//Если НастройкиНачальнойСтраницы = Неопределено Тогда
	//	НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;   
	//	СоставФорм = НастройкиНачальнойСтраницы.ПолучитьСоставФорм();
	//Иначе
	//	СоставФорм = НастройкиНачальнойСтраницы.ПолучитьСоставФорм();		
	//КонецЕсли;     
	//Если СоставФорм.ЛеваяКолонка.Найти("Отчет.УБ_Дашборд.Форма.ФормаМониторов") = Неопределено Тогда
	//	СоставФорм.ЛеваяКолонка.Добавить("Отчет.УБ_Дашборд.Форма.ФормаМониторов");		
	//	НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
	//	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", НастройкиНачальнойСтраницы);
	//КонецЕсли;
	
	
КонецПроцедуры   

           