//редактирование в этой форме не предусмотрено 
//ее назначение - лишь показать в дереве результат назначений
  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТабличныйДокумент = ПолучитьТабДокИзОтчета(Параметры.Ссылка);

КонецПроцедуры                       

&НаСервере
Функция ПолучитьТабДокИзОтчета(Ссылка)
	
		
	СхемаКомпоновкиДанных = Отчеты.УБ_ЗапланированныеПоказателиДокумента.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	СтрПараметр = Настройки.ПараметрыДанных.Элементы.Добавить();
	СтрПараметр.Параметр = Новый ПараметрКомпоновкиДанных("Ссылка");
	СтрПараметр.Значение = Ссылка;
	СтрПараметр.Использование = Истина;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки);

	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ДокументРезультат;
	
КонецФункции
