
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПоказательЭффективности") Тогда
		ОтборПоказатель = Параметры.ПоказательЭффективности;	
	КонецЕсли;
	
	УстановитьОтборыСписка();
		
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыСписка()
	
	СписокДоступныхПоказателей = Новый СписокЗначений;
	СписокДоступныхПоказателей.Добавить(ОтборПоказатель);
	//СписокДоступныхПоказателей.Добавить(?(ТипЗнч(ОтборПоказатель) = Тип("СправочникСсылка.УБ_ПоказателиЭффективности"),
	//	Справочники.УБ_ПоказателиЭффективности.ПустаяСсылка(),Справочники.УБ_ТипыПоказателей.ПустаяСсылка()));
	СписокДоступныхПоказателей.Добавить(Справочники.УБ_ПоказателиЭффективности.ПустаяСсылка());
	СписокДоступныхПоказателей.Добавить(Неопределено);
	
	СписокШкал.Отбор.Элементы.Очистить();
	ЭлементОтбора = СписокШкал.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПоказательЭффективности");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина; 
	ЭлементОтбора.ПравоеЗначение = СписокДоступныхПоказателей;	
	
КонецПроцедуры	

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущиеДанные = Элементы.СписокШкал.ТекущиеДанные;
	
	Результат = Новый Структура;
	Результат.Вставить("ШкалаПоказателя", ТекущиеДанные.ШкалаПоказателей);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокШкалВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокШкал.ТекущиеДанные;
	
	Результат = Новый Структура;
	Результат.Вставить("ШкалаПоказателя", ТекущиеДанные.ШкалаПоказателей);
	
	Закрыть(Результат);
	
КонецПроцедуры
