#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьЗапланированныеПоказатели(Таблица, Движения, Отказ) Экспорт
	
	Если Отказ Или Таблица.Количество() = 0 Тогда	
		Возврат;
	КонецЕсли; 

	ДвиженияЗапланированныеПоказатели = Движения.УБ_ПланПоПоказателям;
	ДвиженияЗапланированныеПоказатели.Записывать = Истина;
	ДвиженияЗапланированныеПоказатели.Загрузить(Таблица); 	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли