#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОтразитьДанныеПоказателейРасчетаЗарплаты(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДанныеПоказателейРасчетаЗарплаты;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДанныеПоказателейРасчетаЗарплаты = Движения.УБ_ДанныеПоказателейРасчетаЗарплаты;
	ДвиженияДанныеПоказателейРасчетаЗарплаты.Записывать = Истина;
	ДвиженияДанныеПоказателейРасчетаЗарплаты.Загрузить(Таблица);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли