

#Область ПрограммныйИнтерфейс

Процедура ОтразитьШкалыПоказателей(ДанныеДокументаУтвержденияГрейда) Экспорт
	
	НаборЗаписей = РегистрыСведений.УБ_УстановленныеШкалыПоказателей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокументаУтвержденияГрейда);
	
	Для каждого Строка из ДанныеДокументаУтвержденияГрейда.ТипыПоказателей Цикл
		Если Строка.ТипПоказателя.Матричный Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Период = ДанныеДокументаУтвержденияГрейда.Дата; 
			Запись.МодельПланирования = ДанныеДокументаУтвержденияГрейда.МодельПланированияЭффективности;
			Запись.Грейд = ДанныеДокументаУтвержденияГрейда.Грейд;
			Запись.ВерсияГрейда = ДанныеДокументаУтвержденияГрейда.ВерсияГрейда;
			Запись.ТипПоказателя = Строка.ТипПоказателя;
			Запись.ШкалаПоказателя = Строка.ШкалаПоказателя;
		КонецЕсли;	
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти