#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
				
	СтруктураСвойствСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка(); 		
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.ПоказателиЭффективности, СтруктураСвойствСписка);
	
	// Установка видимости элементов
	Элементы.ПоказателиЭффективностиСоздать.Видимость = Ложь;
	Элементы.ПоказателиЭффективностиСоздать.Доступность = Ложь;
	Элементы.ПоказателиЭффективностиСоздатьГруппу.Видимость = Ложь;
	Элементы.ПоказателиЭффективностиСоздатьГруппу.Доступность = Ложь;
	Элементы.ПоказателиЭффективностиСкопировать.Видимость = Ложь;
	Элементы.ПоказателиЭффективностиСкопировать.Доступность = Ложь;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказателиЭффективностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	МассивДляПередачи = Новый Массив;
	
	Для каждого ЭлементМассива Из ВыбраннаяСтрока Цикл
		Если НЕ Элементы.ПоказателиЭффективности.ДанныеСтроки(ЭлементМассива).Свойство("ЭтоГруппа") 
			ИЛИ НЕ Элементы.ПоказателиЭффективности.ДанныеСтроки(ЭлементМассива).ЭтоГруппа Тогда
			МассивДляПередачи.Добавить(ЭлементМассива);
		КонецЕсли;
	КонецЦикла;

	ОбработатьВыборРеспондента(МассивДляПередачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиЭффективностиВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОбработатьВыборРеспондента(Значение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборРеспондента(МассивВыбора)
	
	Оповестить("ВыборПоказателей",Новый Структура("ОтобранныеПоказатели",МассивВыбора));
	
КонецПроцедуры

#КонецОбласти