#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтандартныеПодсистемы_ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияШкалыВерхняяГраницаПриИзменении(Элемент)
	
	НомерТекущейСтроки = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.НомерСтроки;   
	Если Объект.ЗначенияШкалы.Количество() = НомерТекущейСтроки Тогда
		Объект.ЗначенияШкалы.Добавить();
	КонецЕсли;
	Объект.ЗначенияШкалы[НомерТекущейСтроки].НижняяГраница = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ВерхняяГраница + 0.00001; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПропорциональныеЗначенияПриИзменении(Элемент)
	
	ПереформироватьПроценты();
	Элементы.ПропорциональныеЗначения.Обновить();
	
	//Режим = РежимДиалогаВопрос.ДаНетОтмена;
	//Ответ = Вопрос("Перенести получившиеся значения?",Режим,0);
	//
	//Если Ответ = КодВозвратаДиалога.Да Тогда
	//	ПеренестиПроцентовку();
	//КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПереформироватьПроценты()
	
	Объект.ПропорциональныеЗначения.Сортировать("Значение Возр");
	Если Объект.ПропорциональныеЗначения.Количество() > 1 Тогда
		МаксЗначение = Объект.ПропорциональныеЗначения[Объект.ПропорциональныеЗначения.Количество()-1].Значение;
		Для каждого Строка Из Объект.ПропорциональныеЗначения Цикл
			Строка.Процент = ?(ЗначениеЗаполнено(Строка.Значение),Строка.Значение,0)/МаксЗначение*100;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры	


&НаСервере
Процедура ПеренестиПроцентовку()
	
	Объект.ЗначенияШкалы.Очистить();
	ПорядковыйНомер = 0;
	Пока ПорядковыйНомер <= Объект.ПропорциональныеЗначения.Количество() Цикл
		НоваяСтрока = Объект.ЗначенияШкалы.Добавить();
		НоваяСтрока.НижняяГраница = ?(ПорядковыйНомер=0,0,Объект.ПропорциональныеЗначения[ПорядковыйНомер-1].Процент);
		НоваяСтрока.ВерхняяГраница = ?(ПорядковыйНомер = Объект.ПропорциональныеЗначения.Количество(),0,Объект.ПропорциональныеЗначения[ПорядковыйНомер].Процент-0.00001);
		ПорядковыйНомер = ПорядковыйНомер+1; 
	КонецЦикла;	
	
	
КонецПроцедуры	

&НаКлиенте
Процедура Перенести(Команда)
	ПеренестиПроцентовку();
КонецПроцедуры

#КонецОбласти

#КонецОбласти