#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЭтоГруппа И Матричный И ЗначениеЗаполнено(БазовыйТипПоказателя) И БазовыйТипПоказателя = Ссылка Тогда
		ТекстОшибки = НСтр("ru = 'Тип показателя не может являться базовым для самого себя'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "БазовыйТипПоказателя",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
