#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОтразитьСоставПоказателейМоделейПланирования(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСоставПоказателейМоделейПланирования;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСоставПоказателейМоделейПланирования = Движения.УБ_СоставПоказателейМоделейПланирования;
	ДвиженияСоставПоказателейМоделейПланирования.Записывать = Истина;
	ДвиженияСоставПоказателейМоделейПланирования.Загрузить(Таблица);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли